:PROPERTIES:
:ID:       c5dd2954-922b-4a43-99d1-5c6386b95f27
:END:
#+title: clj
#+date: [2024-07-03 三]
#+last_modified: [2024-07-05 五 13:15]


#+BEGIN_SRC shell :results silent
  echo "
  (defproject clwing "0.1.0-SNAPSHOT"
    :description "FIXME: write description"
    :url "http://example.com/FIXME"
    :license {:name "EPL-2.0 OR GPL-2.0-or-later WITH Classpath-exception-2.0"
	      :url "https://www.eclipse.org/legal/epl-2.0/"}
    :dependencies [[org.clojure/clojure "1.10.0"]
		   [org.clojure/tools.macro "0.1.5"]]
    :repl-options {:init-ns clwing.repl})
  " > project.clj
#+END_SRC


#+BEGIN_SRC clojure :results output :session clj
  (print "hello world!")
#+END_SRC




#+BEGIN_SRC clojure  :session clj
42
#+END_SRC

#+RESULTS:
: 42
